StructuralCodeName Property
 The family's structural code name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string StructuralCodeName { get; set; }
Visual Basic
Public Property StructuralCodeName As String
	Get
	Set
Visual C++
public:
property String^ StructuralCodeName {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Family Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →